# FabricationConnectorInfo Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationConnectorInfo Properties
FabricationConnectorInfo Class See Also
---
The FabricationConnectorInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BodyConnectorId | Fabrication body connector Id. |
| DoubleWallConnectorId | Fabrication double wall connector Id. |
| FabricationIndex | The index of the connector shown within the fabrication software. |
| IsBodyConnectorLocked | Fabrication body connector lock. |
| IsDoubleWallConnectorLocked | Fabrication double wall connector lock. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace